{
  "return_dict": true,
  "output_hidden_states": false,
  "output_attentions": false,
  "torchscript": false,
  "torch_dtype": null,
  "use_bfloat16": false,
  "tf_legacy_loss": false,
  "pruned_heads": {},
  "tie_word_embeddings": false,
  "chunk_size_feed_forward": 0,
  "is_encoder_decoder": false,
  "is_decoder": false,
  "cross_attention_hidden_size": null,
  "add_cross_attention": false,
  "tie_encoder_decoder": false,
  "max_length": 20,
  "min_length": 0,
  "do_sample": false,
  "early_stopping": false,
  "num_beams": 1,
  "num_beam_groups": 1,
  "diversity_penalty": 0.0,
  "temperature": 1.0,
  "top_k": 50,
  "top_p": 1.0,
  "typical_p": 1.0,
  "repetition_penalty": 1.0,
  "length_penalty": 1.0,
  "no_repeat_ngram_size": 0,
  "encoder_no_repeat_ngram_size": 0,
  "bad_words_ids": null,
  "num_return_sequences": 1,
  "output_scores": false,
  "return_dict_in_generate": false,
  "forced_bos_token_id": null,
  "forced_eos_token_id": null,
  "remove_invalid_values": false,
  "exponential_decay_length_penalty": null,
  "suppress_tokens": null,
  "begin_suppress_tokens": null,
  "architectures": null,
  "finetuning_task": null,
  "id2label": {
    "0": "LABEL_0",
    "1": "LABEL_1"
  },
  "label2id": {
    "LABEL_0": 0,
    "LABEL_1": 1
  },
  "tokenizer_class": null,
  "prefix": null,
  "bos_token_id": null,
  "pad_token_id": null,
  "eos_token_id": null,
  "sep_token_id": null,
  "decoder_start_token_id": null,
  "task_specific_params": null,
  "problem_type": null,
  "_name_or_path": "Open-Pandora",
  "_commit_hash": null,
  "_attn_implementation_internal": null,
  "transformers_version": null,
  "rescale_betas_zero_snr": true,
  "parameterization": "v",
  "linear_start": 0.00085,
  "linear_end": 0.012,
  "num_timesteps_cond": 1,
  "timesteps": 1000,
  "first_stage_key": "video",
  "cond_stage_key": "caption",
  "cond_stage_trainable": false,
  "conditioning_key": "hybrid",
  "image_size": [
    40,
    64
  ],
  "channels": 4,
  "scale_by_std": false,
  "scale_factor": 0.18215,
  "use_ema": false,
  "uncond_type": "empty_seq",
  "use_dynamic_rescale": true,
  "base_scale": 0.7,
  "fps_condition_type": "fps",
  "perframe_ae": true,
  "diffusion_model_name_or_path": "stabilityai/stable-diffusion-2-base",
  "qformer_config": {
    "return_dict": true,
    "output_hidden_states": false,
    "output_attentions": false,
    "torchscript": false,
    "torch_dtype": null,
    "use_bfloat16": false,
    "tf_legacy_loss": false,
    "pruned_heads": {},
    "tie_word_embeddings": true,
    "chunk_size_feed_forward": 0,
    "is_encoder_decoder": false,
    "is_decoder": false,
    "cross_attention_hidden_size": null,
    "add_cross_attention": false,
    "tie_encoder_decoder": false,
    "max_length": 20,
    "min_length": 0,
    "do_sample": false,
    "early_stopping": false,
    "num_beams": 1,
    "num_beam_groups": 1,
    "diversity_penalty": 0.0,
    "temperature": 1.0,
    "top_k": 50,
    "top_p": 1.0,
    "typical_p": 1.0,
    "repetition_penalty": 1.0,
    "length_penalty": 1.0,
    "no_repeat_ngram_size": 0,
    "encoder_no_repeat_ngram_size": 0,
    "bad_words_ids": null,
    "num_return_sequences": 1,
    "output_scores": false,
    "return_dict_in_generate": false,
    "forced_bos_token_id": null,
    "forced_eos_token_id": null,
    "remove_invalid_values": false,
    "exponential_decay_length_penalty": null,
    "suppress_tokens": null,
    "begin_suppress_tokens": null,
    "architectures": null,
    "finetuning_task": null,
    "id2label": {
      "0": "LABEL_0",
      "1": "LABEL_1"
    },
    "label2id": {
      "LABEL_0": 0,
      "LABEL_1": 1
    },
    "tokenizer_class": null,
    "prefix": null,
    "bos_token_id": null,
    "pad_token_id": 0,
    "eos_token_id": null,
    "sep_token_id": null,
    "decoder_start_token_id": null,
    "task_specific_params": null,
    "problem_type": null,
    "_name_or_path": "",
    "transformers_version": "4.44.2",
    "model_name": "blip_2_qformer",
    "vocab_size": 30522,
    "hidden_size": 768,
    "num_hidden_layers": 12,
    "num_attention_heads": 12,
    "hidden_act": "gelu",
    "intermediate_size": 3072,
    "hidden_dropout_prob": 0.1,
    "attention_probs_dropout_prob": 0.1,
    "max_position_embeddings": 512,
    "initializer_range": 0.02,
    "layer_norm_eps": 1e-12,
    "position_embedding_type": "absolute",
    "cross_attention_frequency": 2,
    "encoder_hidden_size": 1408,
    "model_type": "blip_2_qformer"
  },
  "video_model_config": {
    "vocab_size": 32000,
    "max_position_embeddings": 4096,
    "hidden_size": 4096,
    "intermediate_size": 11008,
    "num_hidden_layers": 32,
    "num_attention_heads": 32,
    "num_key_value_heads": 32,
    "hidden_act": "silu",
    "initializer_range": 0.02,
    "rms_norm_eps": 1e-05,
    "pretraining_tp": 1,
    "use_cache": true,
    "rope_theta": 10000.0,
    "rope_scaling": null,
    "attention_bias": false,
    "attention_dropout": 0.0,
    "mlp_bias": false,
    "return_dict": true,
    "output_hidden_states": false,
    "output_attentions": false,
    "torchscript": false,
    "torch_dtype": "bfloat16",
    "use_bfloat16": false,
    "tf_legacy_loss": false,
    "pruned_heads": {},
    "tie_word_embeddings": false,
    "chunk_size_feed_forward": 0,
    "is_encoder_decoder": false,
    "is_decoder": false,
    "cross_attention_hidden_size": null,
    "add_cross_attention": false,
    "tie_encoder_decoder": false,
    "max_length": 20,
    "min_length": 0,
    "do_sample": false,
    "early_stopping": false,
    "num_beams": 1,
    "num_beam_groups": 1,
    "diversity_penalty": 0.0,
    "temperature": 1.0,
    "top_k": 50,
    "top_p": 1.0,
    "typical_p": 1.0,
    "repetition_penalty": 1.0,
    "length_penalty": 1.0,
    "no_repeat_ngram_size": 0,
    "encoder_no_repeat_ngram_size": 0,
    "bad_words_ids": null,
    "num_return_sequences": 1,
    "output_scores": false,
    "return_dict_in_generate": false,
    "forced_bos_token_id": null,
    "forced_eos_token_id": null,
    "remove_invalid_values": false,
    "exponential_decay_length_penalty": null,
    "suppress_tokens": null,
    "begin_suppress_tokens": null,
    "architectures": [
      "ChatUniViLlamaForCausalLM"
    ],
    "finetuning_task": null,
    "id2label": {
      "0": "LABEL_0",
      "1": "LABEL_1"
    },
    "label2id": {
      "LABEL_0": 0,
      "LABEL_1": 1
    },
    "tokenizer_class": null,
    "prefix": null,
    "bos_token_id": 1,
    "pad_token_id": 0,
    "eos_token_id": 2,
    "sep_token_id": null,
    "decoder_start_token_id": null,
    "task_specific_params": null,
    "problem_type": null,
    "_name_or_path": "",
    "transformers_version": "4.44.2",
    "aarchitectures": "ChatUniViLlamaForCausalLM",
    "config": {
      "spatial_cluster_rate0": 64,
      "spatial_cluster_rate1": 32,
      "spatial_cluster_rate2": 16,
      "freeze": false,
      "mm_tune": true,
      "use_cluster": true,
      "temporal_cluster_rate": 0.0625,
      "vision_tune": false
    },
    "freeze_mm_mlp_adapter": false,
    "image_aspect_ratio": "square",
    "image_grid_pinpoints": null,
    "mm_hidden_size": 1024,
    "mm_use_box_start_end": false,
    "mm_use_im_patch_token": false,
    "mm_use_im_start_end": false,
    "mm_vision_select_feature": "patch",
    "mm_vision_select_layer": -2,
    "mm_vision_tower": "openai/clip-vit-large-patch14",
    "model_type": "ChatUniVi",
    "tune_mm_mlp_adapter": false,
    "use_mm_proj": true
  },
  "use_diffusion_text_encoder": false,
  "diffusion_text_encoder_config": {
    "return_dict": true,
    "output_hidden_states": false,
    "output_attentions": false,
    "torchscript": false,
    "torch_dtype": null,
    "use_bfloat16": false,
    "tf_legacy_loss": false,
    "pruned_heads": {},
    "tie_word_embeddings": true,
    "chunk_size_feed_forward": 0,
    "is_encoder_decoder": false,
    "is_decoder": false,
    "cross_attention_hidden_size": null,
    "add_cross_attention": false,
    "tie_encoder_decoder": false,
    "max_length": 20,
    "min_length": 0,
    "do_sample": false,
    "early_stopping": false,
    "num_beams": 1,
    "num_beam_groups": 1,
    "diversity_penalty": 0.0,
    "temperature": 1.0,
    "top_k": 50,
    "top_p": 1.0,
    "typical_p": 1.0,
    "repetition_penalty": 1.0,
    "length_penalty": 1.0,
    "no_repeat_ngram_size": 0,
    "encoder_no_repeat_ngram_size": 0,
    "bad_words_ids": null,
    "num_return_sequences": 1,
    "output_scores": false,
    "return_dict_in_generate": false,
    "forced_bos_token_id": null,
    "forced_eos_token_id": null,
    "remove_invalid_values": false,
    "exponential_decay_length_penalty": null,
    "suppress_tokens": null,
    "begin_suppress_tokens": null,
    "architectures": null,
    "finetuning_task": null,
    "id2label": {
      "0": "LABEL_0",
      "1": "LABEL_1"
    },
    "label2id": {
      "LABEL_0": 0,
      "LABEL_1": 1
    },
    "tokenizer_class": null,
    "prefix": null,
    "bos_token_id": 49406,
    "pad_token_id": 1,
    "eos_token_id": 49407,
    "sep_token_id": null,
    "decoder_start_token_id": null,
    "task_specific_params": null,
    "problem_type": null,
    "_name_or_path": "",
    "transformers_version": "4.44.2",
    "vocab_size": 49408,
    "hidden_size": 512,
    "intermediate_size": 2048,
    "projection_dim": 512,
    "num_hidden_layers": 12,
    "num_attention_heads": 8,
    "max_position_embeddings": 77,
    "layer_norm_eps": 1e-05,
    "hidden_act": "quick_gelu",
    "initializer_range": 0.02,
    "initializer_factor": 1.0,
    "attention_dropout": 0.0,
    "model_type": "clip_text_model"
  },
  "do_alignment": false,
  "diffusion_proj_out_dim": 1024,
  "use_decoder_only_language_model": true,
  "video_model_name_or_path": "/mnt/petrelfs/share_data/quxiaoye/models/Chat-UniVi/",
  "freeze_video_model": true,
  "freeze_diffusion_model": true,
  "freeze_diffusion_text_encoder": true,
  "vocab_size": 32000,
  "initializer_range": 0.02,
  "initializer_factor": 1.0,
  "use_image_prefix": true,
  "image_prefix_length": 64,
  "train_diffusion_cross_attn": false,
  "use_image_callbacks": false,
  "use_image_tokenizer": false,
  "image_vocab_size": 1024,
  "debug_mode": false,
  "train_cfg_ratio": 0.0,
  "use_controlnet": false,
  "use_instructpix2pix": false,
  "freeze_diffusion_qformer": false,
  "learning_rate": 1e-06,
  "use_flash_attn": false,
  "dynamicrafter": "./DynamiCrafter/configs/inference_512_v1.0.yaml",
  "model_type": "world_model"
}